MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG144/mcu.h
extern volatile __CNPDEbits_t CNPDEbits __asm__ ("CNPDE") __attribute__((section("sfrs"), address(0xBF860460)));
extern volatile uint32_t        CNPDECLR __attribute__((section("sfrs"),address(0xBF860464)));
extern volatile uint32_t        CNPDESET __attribute__((section("sfrs"),address(0xBF860468)));
extern volatile uint32_t        CNPDEINV __attribute__((section("sfrs"),address(0xBF86046C)));
#define CNCONE CNCONE
extern volatile uint32_t   CNCONE __attribute__((section("sfrs"), address(0xBF860470)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONEbits_t;
extern volatile __CNCONEbits_t CNCONEbits __asm__ ("CNCONE") __attribute__((section("sfrs"), address(0xBF860470)));
extern volatile uint32_t        CNCONECLR __attribute__((section("sfrs"),address(0xBF860474)));
extern volatile uint32_t        CNCONESET __attribute__((section("sfrs"),address(0xBF860478)));
extern volatile uint32_t        CNCONEINV __attribute__((section("sfrs"),address(0xBF86047C)));
#define CNENE CNENE
extern volatile uint32_t   CNENE __attribute__((section("sfrs"), address(0xBF860480)));
typedef union {
  struct {
    uint32_t CNIEE0:1;
    uint32_t CNIEE1:1;
    uint32_t CNIEE2:1;
    uint32_t CNIEE3:1;
    uint32_t CNIEE4:1;
    uint32_t CNIEE5:1;
    uint32_t CNIEE6:1;
    uint32_t CNIEE7:1;
    uint32_t CNIEE8:1;
    uint32_t CNIEE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENEbits_t;
extern volatile __CNENEbits_t CNENEbits __asm__ ("CNENE") __attribute__((section("sfrs"), address(0xBF860480)));
extern volatile uint32_t        CNENECLR __attribute__((section("sfrs"),address(0xBF860484)));
extern volatile uint32_t        CNENESET __attribute__((section("sfrs"),address(0xBF860488)));
extern volatile uint32_t        CNENEINV __attribute__((section("sfrs"),address(0xBF86048C)));
#define CNSTATE CNSTATE
extern volatile uint32_t   CNSTATE __attribute__((section("sfrs"), address(0xBF860490)));
typedef union {
  struct {
    uint32_t CNSTATE0:1;
    uint32_t CNSTATE1:1;
    uint32_t CNSTATE2:1;
    uint32_t CNSTATE3:1;
    uint32_t CNSTATE4:1;
    uint32_t CNSTATE5:1;
    uint32_t CNSTATE6:1;
    uint32_t CNSTATE7:1;
    uint32_t CNSTATE8:1;
    uint32_t CNSTATE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATEbits_t;
extern volatile __CNSTATEbits_t CNSTATEbits __asm__ ("CNSTATE") __attribute__((section("sfrs"), address(0xBF860490)));
extern volatile uint32_t        CNSTATECLR __attribute__((section("sfrs"),address(0xBF860494)));
extern volatile uint32_t        CNSTATESET __attribute__((section("sfrs"),address(0xBF860498)));
extern volatile uint32_t        CNSTATEINV __attribute__((section("sfrs"),address(0xBF86049C)));
#define ANSELF ANSELF
extern volatile uint32_t   ANSELF __attribute__((section("sfrs"), address(0xBF860500)));
typedef union {
  struct {
    uint32_t :12;
    uint32_t ANSF12:1;
    uint32_t ANSF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELFbits_t;
extern volatile __ANSELFbits_t ANSELFbits __asm__ ("ANSELF") __attribute__((section("sfrs"), address(0xBF860500)));
extern volatile uint32_t        ANSELFCLR __attribute__((section("sfrs"),address(0xBF860504)));
extern volatile uint32_t        ANSELFSET __attribute__((section("sfrs"),address(0xBF860508)));
extern volatile uint32_t        ANSELFINV __attribute__((section("sfrs"),address(0xBF86050C)));
#define TRISF TRISF
extern volatile uint32_t   TRISF __attribute__((section("sfrs"), address(0xBF860510)));
typedef union {
  struct {
    uint32_t TRISF0:1;
    uint32_t TRISF1:1;
    uint32_t TRISF2:1;
    uint32_t TRISF3:1;
    uint32_t TRISF4:1;
    uint32_t TRISF5:1;
    uint32_t :2;
    uint32_t TRISF8:1;
    uint32_t :3;
    uint32_t TRISF12:1;
    uint32_t TRISF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISFbits_t;
extern volatile __TRISFbits_t TRISFbits __asm__ ("TRISF") __attribute__((section("sfrs"), address(0xBF860510)));
extern volatile uint32_t        TRISFCLR __attribute__((section("sfrs"),address(0xBF860514)));
extern volatile uint32_t        TRISFSET __attribute__((section("sfrs"),address(0xBF860518)));
extern volatile uint32_t        TRISFINV __attribute__((section("sfrs"),address(0xBF86051C)));
#define PORTF PORTF
extern volatile uint32_t   PORTF __attribute__((section("sfrs"), address(0xBF860520)));
typedef union {
  struct {
    uint32_t RF0:1;
    uint32_t RF1:1;
    uint32_t RF2:1;
    uint32_t RF3:1;
    uint32_t RF4:1;
    uint32_t RF5:1;
    uint32_t :2;
    uint32_t RF8:1;
    uint32_t :3;
    uint32_t RF12:1;
    uint32_t RF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTFbits_t;
extern volatile __PORTFbits_t PORTFbits __asm__ ("PORTF") __attribute__((section("sfrs"), address(0xBF860520)));
extern volatile uint32_t        PORTFCLR __attribute__((section("sfrs"),address(0xBF860524)));
extern volatile uint32_t        PORTFSET __attribute__((section("sfrs"),address(0xBF860528)));
extern volatile uint32_t        PORTFINV __attribute__((section("sfrs"),address(0xBF86052C)));
#define LATF LATF
extern volatile uint32_t   LATF __attribute__((section("sfrs"), address(0xBF860530)));
typedef union {
  struct {
    uint32_t LATF0:1;
    uint32_t LATF1:1;
    uint32_t LATF2:1;
    uint32_t LATF3:1;
    uint32_t LATF4:1;
    uint32_t LATF5:1;
    uint32_t :2;
    uint32_t LATF8:1;
    uint32_t :3;
    uint32_t LATF12:1;
    uint32_t LATF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATFbits_t;
extern volatile __LATFbits_t LATFbits __asm__ ("LATF") __attribute__((section("sfrs"), address(0xBF860530)));
extern volatile uint32_t        LATFCLR __attribute__((section("sfrs"),address(0xBF860534)));
extern volatile uint32_t        LATFSET __attribute__((section("sfrs"),address(0xBF860538)));
extern volatile uint32_t        LATFINV __attribute__((section("sfrs"),address(0xBF86053C)));
#define ODCF ODCF
extern volatile uint32_t   ODCF __attribute__((section("sfrs"), address(0xBF860540)));
typedef union {
  struct {
    uint32_t ODCF0:1;
    uint32_t ODCF1:1;
    uint32_t ODCF2:1;
    uint32_t ODCF3:1;
    uint32_t ODCF4:1;
    uint32_t ODCF5:1;
    uint32_t :2;
    uint32_t ODCF8:1;
    uint32_t :3;
    uint32_t ODCF12:1;
    uint32_t ODCF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCFbits_t;
extern volatile __ODCFbits_t ODCFbits __asm__ ("ODCF") __attribute__((section("sfrs"), address(0xBF860540)));
extern volatile uint32_t        ODCFCLR __attribute__((section("sfrs"),address(0xBF860544)));
extern volatile uint32_t        ODCFSET __attribute__((section("sfrs"),address(0xBF860548)));
extern volatile uint32_t        ODCFINV __attribute__((section("sfrs"),address(0xBF86054C)));
#define CNPUF CNPUF
extern volatile uint32_t   CNPUF __attribute__((section("sfrs"), address(0xBF860550)));
typedef union {
  struct {
    uint32_t CNPUF0:1;
    uint32_t CNPUF1:1;
    uint32_t CNPUF2:1;
    uint32_t CNPUF3:1;
    uint32_t CNPUF4:1;
    uint32_t CNPUF5:1;
    uint32_t :2;
    uint32_t CNPUF8:1;
    uint32_t :3;
    uint32_t CNPUF12:1;
    uint32_t CNPUF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUFbits_t;
extern volatile __CNPUFbits_t CNPUFbits __asm__ ("CNPUF") __attribute__((section("sfrs"), address(0xBF860550)));
extern volatile uint32_t        CNPUFCLR __attribute__((section("sfrs"),address(0xBF860554)));
extern volatile uint32_t        CNPUFSET __attribute__((section("sfrs"),address(0xBF860558)));
extern volatile uint32_t        CNPUFINV __attribute__((section("sfrs"),address(0xBF86055C)));
#define CNPDF CNPDF
extern volatile uint32_t   CNPDF __attribute__((section("sfrs"), address(0xBF860560)));
typedef union {
  struct {
    uint32_t CNPDF0:1;
    uint32_t CNPDF1:1;
    uint32_t CNPDF2:1;
    uint32_t CNPDF3:1;
    uint32_t CNPDF4:1;
    uint32_t CNPDF5:1;
    uint32_t :2;
    uint32_t CNPDF8:1;
    uint32_t :3;
    uint32_t CNPDF12:1;
    uint32_t CNPDF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDFbits_t;
extern volatile __CNPDFbits_t CNPDFbits __asm__ ("CNPDF") __attribute__((section("sfrs"), address(0xBF860560)));
extern volatile uint32_t        CNPDFCLR __attribute__((section("sfrs"),address(0xBF860564)));
extern volatile uint32_t        CNPDFSET __attribute__((section("sfrs"),address(0xBF860568)));
extern volatile uint32_t        CNPDFINV __attribute__((section("sfrs"),address(0xBF86056C)));
#define CNCONF CNCONF
extern volatile uint32_t   CNCONF __attribute__((section("sfrs"), address(0xBF860570)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONFbits_t;
extern volatile __CNCONFbits_t CNCONFbits __asm__ ("CNCONF") __attribute__((section("sfrs"), address(0xBF860570)));
extern volatile uint32_t        CNCONFCLR __attribute__((section("sfrs"),address(0xBF860574)));
extern volatile uint32_t        CNCONFSET __attribute__((section("sfrs"),address(0xBF860578)));
extern volatile uint32_t        CNCONFINV __attribute__((section("sfrs"),address(0xBF86057C)));
#define CNENF CNENF
extern volatile uint32_t   CNENF __attribute__((section("sfrs"), address(0xBF860580)));
typedef union {
  struct {
    uint32_t CNIEF0:1;
    uint32_t CNIEF1:1;
    uint32_t CNIEF2:1;
    uint32_t CNIEF3:1;
    uint32_t CNIEF4:1;
    uint32_t CNIEF5:1;
    uint32_t :2;
    uint32_t CNIEF8:1;
    uint32_t :3;
    uint32_t CNIEF12:1;
    uint32_t CNIEF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENFbits_t;
