MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG144/mcu.h
extern volatile __SQI1INTSTATbits_t SQI1INTSTATbits __asm__ ("SQI1INTSTAT") __attribute__((section("sfrs"), address(0xBF8E2020)));
#define SQI1TXBUF SQI1TXBUF
extern volatile uint32_t   SQI1TXBUF __attribute__((section("sfrs"), address(0xBF8E2024)));
typedef struct {
  uint32_t TXDATA:32;
} __SQI1TXBUFbits_t;
extern volatile __SQI1TXBUFbits_t SQI1TXBUFbits __asm__ ("SQI1TXBUF") __attribute__((section("sfrs"), address(0xBF8E2024)));
#define SQI1RXBUF SQI1RXBUF
extern volatile uint32_t   SQI1RXBUF __attribute__((section("sfrs"), address(0xBF8E2028)));
typedef struct {
  uint32_t RXDATA:32;
} __SQI1RXBUFbits_t;
extern volatile __SQI1RXBUFbits_t SQI1RXBUFbits __asm__ ("SQI1RXBUF") __attribute__((section("sfrs"), address(0xBF8E2028)));
#define SQI1STAT1 SQI1STAT1
extern volatile uint32_t   SQI1STAT1 __attribute__((section("sfrs"), address(0xBF8E202C)));
typedef struct {
  uint32_t RXBUFCNT:8;
  uint32_t :8;
  uint32_t TXBUFFREE:8;
} __SQI1STAT1bits_t;
extern volatile __SQI1STAT1bits_t SQI1STAT1bits __asm__ ("SQI1STAT1") __attribute__((section("sfrs"), address(0xBF8E202C)));
#define SQI1STAT2 SQI1STAT2
extern volatile uint32_t   SQI1STAT2 __attribute__((section("sfrs"), address(0xBF8E2030)));
typedef struct {
  uint32_t TXOV:1;
  uint32_t RXUN:1;
  uint32_t :1;
  uint32_t SQID0:1;
  uint32_t SQID1:1;
  uint32_t SQID2:1;
  uint32_t SQID3:1;
} __SQI1STAT2bits_t;
extern volatile __SQI1STAT2bits_t SQI1STAT2bits __asm__ ("SQI1STAT2") __attribute__((section("sfrs"), address(0xBF8E2030)));
#define SQI1BDCON SQI1BDCON
extern volatile uint32_t   SQI1BDCON __attribute__((section("sfrs"), address(0xBF8E2034)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t POLLEN:1;
  uint32_t START:1;
} __SQI1BDCONbits_t;
extern volatile __SQI1BDCONbits_t SQI1BDCONbits __asm__ ("SQI1BDCON") __attribute__((section("sfrs"), address(0xBF8E2034)));
#define SQI1BDCURADD SQI1BDCURADD
extern volatile uint32_t   SQI1BDCURADD __attribute__((section("sfrs"), address(0xBF8E2038)));
typedef struct {
  uint32_t BDCURRADDR:32;
} __SQI1BDCURADDbits_t;
extern volatile __SQI1BDCURADDbits_t SQI1BDCURADDbits __asm__ ("SQI1BDCURADD") __attribute__((section("sfrs"), address(0xBF8E2038)));
#define SQI1BDBASEADDR SQI1BDBASEADDR
extern volatile uint32_t   SQI1BDBASEADDR __attribute__((section("sfrs"), address(0xBF8E2040)));
typedef struct {
  uint32_t BDADDR:32;
} __SQI1BDBASEADDRbits_t;
extern volatile __SQI1BDBASEADDRbits_t SQI1BDBASEADDRbits __asm__ ("SQI1BDBASEADDR") __attribute__((section("sfrs"), address(0xBF8E2040)));
#define SQI1BDSTAT SQI1BDSTAT
extern volatile uint32_t   SQI1BDSTAT __attribute__((section("sfrs"), address(0xBF8E2044)));
typedef struct {
  uint32_t BDCON:16;
  uint32_t DMAACTV:1;
  uint32_t DMASTART:1;
  uint32_t BDSTATE:4;
} __SQI1BDSTATbits_t;
extern volatile __SQI1BDSTATbits_t SQI1BDSTATbits __asm__ ("SQI1BDSTAT") __attribute__((section("sfrs"), address(0xBF8E2044)));
#define SQI1BDPOLLCON SQI1BDPOLLCON
extern volatile uint32_t   SQI1BDPOLLCON __attribute__((section("sfrs"), address(0xBF8E2048)));
typedef struct {
  uint32_t POLLCON:16;
} __SQI1BDPOLLCONbits_t;
extern volatile __SQI1BDPOLLCONbits_t SQI1BDPOLLCONbits __asm__ ("SQI1BDPOLLCON") __attribute__((section("sfrs"), address(0xBF8E2048)));
#define SQI1BDTXDSTAT SQI1BDTXDSTAT
extern volatile uint32_t   SQI1BDTXDSTAT __attribute__((section("sfrs"), address(0xBF8E204C)));
typedef struct {
  uint32_t TXCURBUFLEN:8;
  uint32_t :8;
  uint32_t TXBUFCNT:5;
  uint32_t :4;
  uint32_t TXSTATE:4;
} __SQI1BDTXDSTATbits_t;
extern volatile __SQI1BDTXDSTATbits_t SQI1BDTXDSTATbits __asm__ ("SQI1BDTXDSTAT") __attribute__((section("sfrs"), address(0xBF8E204C)));
#define SQI1BDRXDSTAT SQI1BDRXDSTAT
extern volatile uint32_t   SQI1BDRXDSTAT __attribute__((section("sfrs"), address(0xBF8E2050)));
typedef struct {
  uint32_t RXCURBUFLEN:8;
  uint32_t :8;
  uint32_t RXBUFCNT:5;
  uint32_t :4;
  uint32_t RXSTATE:4;
} __SQI1BDRXDSTATbits_t;
extern volatile __SQI1BDRXDSTATbits_t SQI1BDRXDSTATbits __asm__ ("SQI1BDRXDSTAT") __attribute__((section("sfrs"), address(0xBF8E2050)));
#define SQI1THR SQI1THR
extern volatile uint32_t   SQI1THR __attribute__((section("sfrs"), address(0xBF8E2054)));
typedef struct {
  uint32_t THRES:7;
} __SQI1THRbits_t;
extern volatile __SQI1THRbits_t SQI1THRbits __asm__ ("SQI1THR") __attribute__((section("sfrs"), address(0xBF8E2054)));
#define SQI1INTSEN SQI1INTSEN
extern volatile uint32_t   SQI1INTSEN __attribute__((section("sfrs"), address(0xBF8E2058)));
typedef struct {
  uint32_t TXEMPTYISE:1;
  uint32_t TXFULLISE:1;
  uint32_t TXTHRISE:1;
  uint32_t RXEMPTYISE:1;
  uint32_t RXFULLISE:1;
  uint32_t RXTHRISE:1;
  uint32_t CONFULLISE:1;
  uint32_t CONEMPTYISE:1;
  uint32_t CONTHRISE:1;
  uint32_t BDDONEISE:1;
  uint32_t PKTCOMPISE:1;
} __SQI1INTSENbits_t;
extern volatile __SQI1INTSENbits_t SQI1INTSENbits __asm__ ("SQI1INTSEN") __attribute__((section("sfrs"), address(0xBF8E2058)));
#define USBCSR0 USBCSR0
extern volatile uint32_t   USBCSR0 __attribute__((section("sfrs"), address(0xBF8E3000)));
typedef struct {
  uint32_t FUNC:7;
  uint32_t :1;
  uint32_t SUSPEN:1;
  uint32_t SUSPMODE:1;
  uint32_t RESUME:1;
  uint32_t RESET:1;
  uint32_t HSMODE:1;
  uint32_t HSEN:1;
  uint32_t SOFTCONN:1;
  uint32_t ISOUPD:1;
  uint32_t EP0IF:1;
  uint32_t EP1TXIF:1;
  uint32_t EP2TXIF:1;
  uint32_t EP3TXIF:1;
  uint32_t EP4TXIF:1;
  uint32_t EP5TXIF:1;
  uint32_t EP6TXIF:1;
  uint32_t EP7TXIF:1;
} __USBCSR0bits_t;
extern volatile __USBCSR0bits_t USBCSR0bits __asm__ ("USBCSR0") __attribute__((section("sfrs"), address(0xBF8E3000)));
#define USBCSR1 USBCSR1
extern volatile uint32_t   USBCSR1 __attribute__((section("sfrs"), address(0xBF8E3004)));
typedef struct {
  uint32_t :1;
  uint32_t EP1RXIF:1;
  uint32_t EP2RXIF:1;
  uint32_t EP3RXIF:1;
  uint32_t EP4RXIF:1;
  uint32_t EP5RXIF:1;
  uint32_t EP6RXIF:1;
  uint32_t EP7RXIF:1;
  uint32_t :8;
  uint32_t EP0IE:1;
  uint32_t EP1TXIE:1;
  uint32_t EP2TXIE:1;
  uint32_t EP3TXIE:1;
  uint32_t EP4TXIE:1;
  uint32_t EP5TXIE:1;
  uint32_t EP6TXIE:1;
  uint32_t EP7TXIE:1;
} __USBCSR1bits_t;
