MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG144/mcu.h
#define _IFS1_AD1DC2IF_POSITION                  0x0000000F
#define _IFS1_AD1DC2IF_MASK                      0x00008000
#define _IFS1_AD1DC2IF_LENGTH                    0x00000001

#define _IFS1_AD1DC3IF_POSITION                  0x00000010
#define _IFS1_AD1DC3IF_MASK                      0x00010000
#define _IFS1_AD1DC3IF_LENGTH                    0x00000001

#define _IFS1_AD1DC4IF_POSITION                  0x00000011
#define _IFS1_AD1DC4IF_MASK                      0x00020000
#define _IFS1_AD1DC4IF_LENGTH                    0x00000001

#define _IFS1_AD1DC5IF_POSITION                  0x00000012
#define _IFS1_AD1DC5IF_MASK                      0x00040000
#define _IFS1_AD1DC5IF_LENGTH                    0x00000001

#define _IFS1_AD1DC6IF_POSITION                  0x00000013
#define _IFS1_AD1DC6IF_MASK                      0x00080000
#define _IFS1_AD1DC6IF_LENGTH                    0x00000001

#define _IFS1_AD1DF1IF_POSITION                  0x00000014
#define _IFS1_AD1DF1IF_MASK                      0x00100000
#define _IFS1_AD1DF1IF_LENGTH                    0x00000001

#define _IFS1_AD1DF2IF_POSITION                  0x00000015
#define _IFS1_AD1DF2IF_MASK                      0x00200000
#define _IFS1_AD1DF2IF_LENGTH                    0x00000001

#define _IFS1_AD1DF3IF_POSITION                  0x00000016
#define _IFS1_AD1DF3IF_MASK                      0x00400000
#define _IFS1_AD1DF3IF_LENGTH                    0x00000001

#define _IFS1_AD1DF4IF_POSITION                  0x00000017
#define _IFS1_AD1DF4IF_MASK                      0x00800000
#define _IFS1_AD1DF4IF_LENGTH                    0x00000001

#define _IFS1_AD1DF5IF_POSITION                  0x00000018
#define _IFS1_AD1DF5IF_MASK                      0x01000000
#define _IFS1_AD1DF5IF_LENGTH                    0x00000001

#define _IFS1_AD1DF6IF_POSITION                  0x00000019
#define _IFS1_AD1DF6IF_MASK                      0x02000000
#define _IFS1_AD1DF6IF_LENGTH                    0x00000001

#define _IFS1_AD1D0IF_POSITION                   0x0000001B
#define _IFS1_AD1D0IF_MASK                       0x08000000
#define _IFS1_AD1D0IF_LENGTH                     0x00000001

#define _IFS1_AD1D1IF_POSITION                   0x0000001C
#define _IFS1_AD1D1IF_MASK                       0x10000000
#define _IFS1_AD1D1IF_LENGTH                     0x00000001

#define _IFS1_AD1D2IF_POSITION                   0x0000001D
#define _IFS1_AD1D2IF_MASK                       0x20000000
#define _IFS1_AD1D2IF_LENGTH                     0x00000001

#define _IFS1_AD1D3IF_POSITION                   0x0000001E
#define _IFS1_AD1D3IF_MASK                       0x40000000
#define _IFS1_AD1D3IF_LENGTH                     0x00000001

#define _IFS1_AD1D4IF_POSITION                   0x0000001F
#define _IFS1_AD1D4IF_MASK                       0x80000000
#define _IFS1_AD1D4IF_LENGTH                     0x00000001

#define _IFS1_w_POSITION                         0x00000000
#define _IFS1_w_MASK                             0xFFFFFFFF
#define _IFS1_w_LENGTH                           0x00000020

#define _IFS2_AD1D5IF_POSITION                   0x00000000
#define _IFS2_AD1D5IF_MASK                       0x00000001
#define _IFS2_AD1D5IF_LENGTH                     0x00000001

#define _IFS2_AD1D6IF_POSITION                   0x00000001
#define _IFS2_AD1D6IF_MASK                       0x00000002
#define _IFS2_AD1D6IF_LENGTH                     0x00000001

#define _IFS2_AD1D7IF_POSITION                   0x00000002
#define _IFS2_AD1D7IF_MASK                       0x00000004
#define _IFS2_AD1D7IF_LENGTH                     0x00000001

#define _IFS2_AD1D8IF_POSITION                   0x00000003
#define _IFS2_AD1D8IF_MASK                       0x00000008
#define _IFS2_AD1D8IF_LENGTH                     0x00000001

#define _IFS2_AD1D9IF_POSITION                   0x00000004
#define _IFS2_AD1D9IF_MASK                       0x00000010
#define _IFS2_AD1D9IF_LENGTH                     0x00000001

#define _IFS2_AD1D10IF_POSITION                  0x00000005
#define _IFS2_AD1D10IF_MASK                      0x00000020
#define _IFS2_AD1D10IF_LENGTH                    0x00000001

#define _IFS2_AD1D11IF_POSITION                  0x00000006
#define _IFS2_AD1D11IF_MASK                      0x00000040
#define _IFS2_AD1D11IF_LENGTH                    0x00000001

#define _IFS2_AD1D12IF_POSITION                  0x00000007
#define _IFS2_AD1D12IF_MASK                      0x00000080
#define _IFS2_AD1D12IF_LENGTH                    0x00000001

#define _IFS2_AD1D13IF_POSITION                  0x00000008
#define _IFS2_AD1D13IF_MASK                      0x00000100
#define _IFS2_AD1D13IF_LENGTH                    0x00000001

#define _IFS2_AD1D14IF_POSITION                  0x00000009
#define _IFS2_AD1D14IF_MASK                      0x00000200
#define _IFS2_AD1D14IF_LENGTH                    0x00000001

#define _IFS2_AD1D15IF_POSITION                  0x0000000A
#define _IFS2_AD1D15IF_MASK                      0x00000400
#define _IFS2_AD1D15IF_LENGTH                    0x00000001

#define _IFS2_AD1D16IF_POSITION                  0x0000000B
#define _IFS2_AD1D16IF_MASK                      0x00000800
#define _IFS2_AD1D16IF_LENGTH                    0x00000001

#define _IFS2_AD1D17IF_POSITION                  0x0000000C
#define _IFS2_AD1D17IF_MASK                      0x00001000
#define _IFS2_AD1D17IF_LENGTH                    0x00000001

#define _IFS2_AD1D18IF_POSITION                  0x0000000D
#define _IFS2_AD1D18IF_MASK                      0x00002000
#define _IFS2_AD1D18IF_LENGTH                    0x00000001

#define _IFS2_AD1D19IF_POSITION                  0x0000000E
#define _IFS2_AD1D19IF_MASK                      0x00004000
#define _IFS2_AD1D19IF_LENGTH                    0x00000001

#define _IFS2_AD1D20IF_POSITION                  0x0000000F
#define _IFS2_AD1D20IF_MASK                      0x00008000
#define _IFS2_AD1D20IF_LENGTH                    0x00000001

#define _IFS2_AD1D21IF_POSITION                  0x00000010
#define _IFS2_AD1D21IF_MASK                      0x00010000
#define _IFS2_AD1D21IF_LENGTH                    0x00000001

#define _IFS2_AD1D22IF_POSITION                  0x00000011
#define _IFS2_AD1D22IF_MASK                      0x00020000
#define _IFS2_AD1D22IF_LENGTH                    0x00000001

