MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG144/mcu.h
#define _AD1CON2_LOWPWR_POSITION                 0x0000000D
#define _AD1CON2_LOWPWR_MASK                     0x00002000
#define _AD1CON2_LOWPWR_LENGTH                   0x00000001

#define _AD1CON2_BOOST_POSITION                  0x0000000E
#define _AD1CON2_BOOST_MASK                      0x00004000
#define _AD1CON2_BOOST_LENGTH                    0x00000001

#define _AD1CON2_SAMC_POSITION                   0x00000010
#define _AD1CON2_SAMC_MASK                       0x00FF0000
#define _AD1CON2_SAMC_LENGTH                     0x00000008

#define _AD1CON2_ADCRDY_POSITION                 0x0000001F
#define _AD1CON2_ADCRDY_MASK                     0x80000000
#define _AD1CON2_ADCRDY_LENGTH                   0x00000001

#define _AD1CON3_ADINSEL_POSITION                0x00000000
#define _AD1CON3_ADINSEL_MASK                    0x0000003F
#define _AD1CON3_ADINSEL_LENGTH                  0x00000006

#define _AD1CON3_VREFSEL_POSITION                0x0000000A
#define _AD1CON3_VREFSEL_MASK                    0x00001C00
#define _AD1CON3_VREFSEL_LENGTH                  0x00000003

#define _AD1CON3_RQCONVRT_POSITION               0x0000001D
#define _AD1CON3_RQCONVRT_MASK                   0x20000000
#define _AD1CON3_RQCONVRT_LENGTH                 0x00000001

#define _AD1CON3_GSWTRG_POSITION                 0x0000001E
#define _AD1CON3_GSWTRG_MASK                     0x40000000
#define _AD1CON3_GSWTRG_LENGTH                   0x00000001

#define _AD1CON3_CAL_POSITION                    0x0000001F
#define _AD1CON3_CAL_MASK                        0x80000000
#define _AD1CON3_CAL_LENGTH                      0x00000001

#define _AD1IMOD_SH0MOD_POSITION                 0x00000000
#define _AD1IMOD_SH0MOD_MASK                     0x00000003
#define _AD1IMOD_SH0MOD_LENGTH                   0x00000002

#define _AD1IMOD_SH1MOD_POSITION                 0x00000002
#define _AD1IMOD_SH1MOD_MASK                     0x0000000C
#define _AD1IMOD_SH1MOD_LENGTH                   0x00000002

#define _AD1IMOD_SH2MOD_POSITION                 0x00000004
#define _AD1IMOD_SH2MOD_MASK                     0x00000030
#define _AD1IMOD_SH2MOD_LENGTH                   0x00000002

#define _AD1IMOD_SH3MOD_POSITION                 0x00000006
#define _AD1IMOD_SH3MOD_MASK                     0x000000C0
#define _AD1IMOD_SH3MOD_LENGTH                   0x00000002

#define _AD1IMOD_SH4MOD_POSITION                 0x00000008
#define _AD1IMOD_SH4MOD_MASK                     0x00000300
#define _AD1IMOD_SH4MOD_LENGTH                   0x00000002

#define _AD1IMOD_SH5MOD_POSITION                 0x0000000A
#define _AD1IMOD_SH5MOD_MASK                     0x00000C00
#define _AD1IMOD_SH5MOD_LENGTH                   0x00000002

#define _AD1IMOD_SH0ALT_POSITION                 0x00000010
#define _AD1IMOD_SH0ALT_MASK                     0x00030000
#define _AD1IMOD_SH0ALT_LENGTH                   0x00000002

#define _AD1IMOD_SH1ALT_POSITION                 0x00000012
#define _AD1IMOD_SH1ALT_MASK                     0x000C0000
#define _AD1IMOD_SH1ALT_LENGTH                   0x00000002

#define _AD1IMOD_SH2ALT_POSITION                 0x00000014
#define _AD1IMOD_SH2ALT_MASK                     0x00300000
#define _AD1IMOD_SH2ALT_LENGTH                   0x00000002

#define _AD1IMOD_SH3ALT_POSITION                 0x00000016
#define _AD1IMOD_SH3ALT_MASK                     0x00C00000
#define _AD1IMOD_SH3ALT_LENGTH                   0x00000002

#define _AD1IMOD_SH4ALT_POSITION                 0x00000018
#define _AD1IMOD_SH4ALT_MASK                     0x03000000
#define _AD1IMOD_SH4ALT_LENGTH                   0x00000002

#define _AD1GIRQEN1_AGIEN0_POSITION              0x00000000
#define _AD1GIRQEN1_AGIEN0_MASK                  0x00000001
#define _AD1GIRQEN1_AGIEN0_LENGTH                0x00000001

#define _AD1GIRQEN1_AGIEN1_POSITION              0x00000001
#define _AD1GIRQEN1_AGIEN1_MASK                  0x00000002
#define _AD1GIRQEN1_AGIEN1_LENGTH                0x00000001

#define _AD1GIRQEN1_AGIEN2_POSITION              0x00000002
#define _AD1GIRQEN1_AGIEN2_MASK                  0x00000004
#define _AD1GIRQEN1_AGIEN2_LENGTH                0x00000001

#define _AD1GIRQEN1_AGIEN3_POSITION              0x00000003
#define _AD1GIRQEN1_AGIEN3_MASK                  0x00000008
#define _AD1GIRQEN1_AGIEN3_LENGTH                0x00000001

#define _AD1GIRQEN1_AGIEN4_POSITION              0x00000004
#define _AD1GIRQEN1_AGIEN4_MASK                  0x00000010
#define _AD1GIRQEN1_AGIEN4_LENGTH                0x00000001

#define _AD1GIRQEN1_AGIEN5_POSITION              0x00000005
#define _AD1GIRQEN1_AGIEN5_MASK                  0x00000020
#define _AD1GIRQEN1_AGIEN5_LENGTH                0x00000001

#define _AD1GIRQEN1_AGIEN6_POSITION              0x00000006
#define _AD1GIRQEN1_AGIEN6_MASK                  0x00000040
#define _AD1GIRQEN1_AGIEN6_LENGTH                0x00000001

#define _AD1GIRQEN1_AGIEN7_POSITION              0x00000007
#define _AD1GIRQEN1_AGIEN7_MASK                  0x00000080
#define _AD1GIRQEN1_AGIEN7_LENGTH                0x00000001

#define _AD1GIRQEN1_AGIEN8_POSITION              0x00000008
#define _AD1GIRQEN1_AGIEN8_MASK                  0x00000100
#define _AD1GIRQEN1_AGIEN8_LENGTH                0x00000001

#define _AD1GIRQEN1_AGIEN9_POSITION              0x00000009
#define _AD1GIRQEN1_AGIEN9_MASK                  0x00000200
#define _AD1GIRQEN1_AGIEN9_LENGTH                0x00000001

#define _AD1GIRQEN1_AGIEN10_POSITION             0x0000000A
#define _AD1GIRQEN1_AGIEN10_MASK                 0x00000400
#define _AD1GIRQEN1_AGIEN10_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN11_POSITION             0x0000000B
#define _AD1GIRQEN1_AGIEN11_MASK                 0x00000800
#define _AD1GIRQEN1_AGIEN11_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN12_POSITION             0x0000000C
#define _AD1GIRQEN1_AGIEN12_MASK                 0x00001000
#define _AD1GIRQEN1_AGIEN12_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN13_POSITION             0x0000000D
#define _AD1GIRQEN1_AGIEN13_MASK                 0x00002000
#define _AD1GIRQEN1_AGIEN13_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN14_POSITION             0x0000000E
#define _AD1GIRQEN1_AGIEN14_MASK                 0x00004000
#define _AD1GIRQEN1_AGIEN14_LENGTH               0x00000001

