MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG144/mcu.h
#define _CNSTATH_CNSTATH0_POSITION               0x00000000
#define _CNSTATH_CNSTATH0_MASK                   0x00000001
#define _CNSTATH_CNSTATH0_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH1_POSITION               0x00000001
#define _CNSTATH_CNSTATH1_MASK                   0x00000002
#define _CNSTATH_CNSTATH1_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH2_POSITION               0x00000002
#define _CNSTATH_CNSTATH2_MASK                   0x00000004
#define _CNSTATH_CNSTATH2_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH3_POSITION               0x00000003
#define _CNSTATH_CNSTATH3_MASK                   0x00000008
#define _CNSTATH_CNSTATH3_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH4_POSITION               0x00000004
#define _CNSTATH_CNSTATH4_MASK                   0x00000010
#define _CNSTATH_CNSTATH4_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH5_POSITION               0x00000005
#define _CNSTATH_CNSTATH5_MASK                   0x00000020
#define _CNSTATH_CNSTATH5_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH6_POSITION               0x00000006
#define _CNSTATH_CNSTATH6_MASK                   0x00000040
#define _CNSTATH_CNSTATH6_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH7_POSITION               0x00000007
#define _CNSTATH_CNSTATH7_MASK                   0x00000080
#define _CNSTATH_CNSTATH7_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH8_POSITION               0x00000008
#define _CNSTATH_CNSTATH8_MASK                   0x00000100
#define _CNSTATH_CNSTATH8_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH9_POSITION               0x00000009
#define _CNSTATH_CNSTATH9_MASK                   0x00000200
#define _CNSTATH_CNSTATH9_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH10_POSITION              0x0000000A
#define _CNSTATH_CNSTATH10_MASK                  0x00000400
#define _CNSTATH_CNSTATH10_LENGTH                0x00000001

#define _CNSTATH_CNSTATH11_POSITION              0x0000000B
#define _CNSTATH_CNSTATH11_MASK                  0x00000800
#define _CNSTATH_CNSTATH11_LENGTH                0x00000001

#define _CNSTATH_CNSTATH12_POSITION              0x0000000C
#define _CNSTATH_CNSTATH12_MASK                  0x00001000
#define _CNSTATH_CNSTATH12_LENGTH                0x00000001

#define _CNSTATH_CNSTATH13_POSITION              0x0000000D
#define _CNSTATH_CNSTATH13_MASK                  0x00002000
#define _CNSTATH_CNSTATH13_LENGTH                0x00000001

#define _CNSTATH_CNSTATH14_POSITION              0x0000000E
#define _CNSTATH_CNSTATH14_MASK                  0x00004000
#define _CNSTATH_CNSTATH14_LENGTH                0x00000001

#define _CNSTATH_CNSTATH15_POSITION              0x0000000F
#define _CNSTATH_CNSTATH15_MASK                  0x00008000
#define _CNSTATH_CNSTATH15_LENGTH                0x00000001

#define _CNSTATH_w_POSITION                      0x00000000
#define _CNSTATH_w_MASK                          0xFFFFFFFF
#define _CNSTATH_w_LENGTH                        0x00000020

#define _ANSELJ_ANSJ8_POSITION                   0x00000008
#define _ANSELJ_ANSJ8_MASK                       0x00000100
#define _ANSELJ_ANSJ8_LENGTH                     0x00000001

#define _ANSELJ_ANSJ9_POSITION                   0x00000009
#define _ANSELJ_ANSJ9_MASK                       0x00000200
#define _ANSELJ_ANSJ9_LENGTH                     0x00000001

#define _ANSELJ_ANSJ11_POSITION                  0x0000000B
#define _ANSELJ_ANSJ11_MASK                      0x00000800
#define _ANSELJ_ANSJ11_LENGTH                    0x00000001

#define _ANSELJ_w_POSITION                       0x00000000
#define _ANSELJ_w_MASK                           0xFFFFFFFF
#define _ANSELJ_w_LENGTH                         0x00000020

#define _TRISJ_TRISJ0_POSITION                   0x00000000
#define _TRISJ_TRISJ0_MASK                       0x00000001
#define _TRISJ_TRISJ0_LENGTH                     0x00000001

#define _TRISJ_TRISJ1_POSITION                   0x00000001
#define _TRISJ_TRISJ1_MASK                       0x00000002
#define _TRISJ_TRISJ1_LENGTH                     0x00000001

#define _TRISJ_TRISJ2_POSITION                   0x00000002
#define _TRISJ_TRISJ2_MASK                       0x00000004
#define _TRISJ_TRISJ2_LENGTH                     0x00000001

#define _TRISJ_TRISJ3_POSITION                   0x00000003
#define _TRISJ_TRISJ3_MASK                       0x00000008
#define _TRISJ_TRISJ3_LENGTH                     0x00000001

#define _TRISJ_TRISJ4_POSITION                   0x00000004
#define _TRISJ_TRISJ4_MASK                       0x00000010
#define _TRISJ_TRISJ4_LENGTH                     0x00000001

#define _TRISJ_TRISJ5_POSITION                   0x00000005
#define _TRISJ_TRISJ5_MASK                       0x00000020
#define _TRISJ_TRISJ5_LENGTH                     0x00000001

#define _TRISJ_TRISJ6_POSITION                   0x00000006
#define _TRISJ_TRISJ6_MASK                       0x00000040
#define _TRISJ_TRISJ6_LENGTH                     0x00000001

#define _TRISJ_TRISJ7_POSITION                   0x00000007
#define _TRISJ_TRISJ7_MASK                       0x00000080
#define _TRISJ_TRISJ7_LENGTH                     0x00000001

#define _TRISJ_TRISJ8_POSITION                   0x00000008
#define _TRISJ_TRISJ8_MASK                       0x00000100
#define _TRISJ_TRISJ8_LENGTH                     0x00000001

#define _TRISJ_TRISJ9_POSITION                   0x00000009
#define _TRISJ_TRISJ9_MASK                       0x00000200
#define _TRISJ_TRISJ9_LENGTH                     0x00000001

#define _TRISJ_TRISJ10_POSITION                  0x0000000A
#define _TRISJ_TRISJ10_MASK                      0x00000400
#define _TRISJ_TRISJ10_LENGTH                    0x00000001

#define _TRISJ_TRISJ11_POSITION                  0x0000000B
#define _TRISJ_TRISJ11_MASK                      0x00000800
#define _TRISJ_TRISJ11_LENGTH                    0x00000001

#define _TRISJ_TRISJ12_POSITION                  0x0000000C
#define _TRISJ_TRISJ12_MASK                      0x00001000
#define _TRISJ_TRISJ12_LENGTH                    0x00000001

