MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG144/mcu.h
#define _CNENJ_CNIEJ15_POSITION                  0x0000000F
#define _CNENJ_CNIEJ15_MASK                      0x00008000
#define _CNENJ_CNIEJ15_LENGTH                    0x00000001

#define _CNENJ_w_POSITION                        0x00000000
#define _CNENJ_w_MASK                            0xFFFFFFFF
#define _CNENJ_w_LENGTH                          0x00000020

#define _CNSTATJ_CNSTATJ0_POSITION               0x00000000
#define _CNSTATJ_CNSTATJ0_MASK                   0x00000001
#define _CNSTATJ_CNSTATJ0_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ1_POSITION               0x00000001
#define _CNSTATJ_CNSTATJ1_MASK                   0x00000002
#define _CNSTATJ_CNSTATJ1_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ2_POSITION               0x00000002
#define _CNSTATJ_CNSTATJ2_MASK                   0x00000004
#define _CNSTATJ_CNSTATJ2_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ3_POSITION               0x00000003
#define _CNSTATJ_CNSTATJ3_MASK                   0x00000008
#define _CNSTATJ_CNSTATJ3_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ4_POSITION               0x00000004
#define _CNSTATJ_CNSTATJ4_MASK                   0x00000010
#define _CNSTATJ_CNSTATJ4_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ5_POSITION               0x00000005
#define _CNSTATJ_CNSTATJ5_MASK                   0x00000020
#define _CNSTATJ_CNSTATJ5_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ6_POSITION               0x00000006
#define _CNSTATJ_CNSTATJ6_MASK                   0x00000040
#define _CNSTATJ_CNSTATJ6_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ7_POSITION               0x00000007
#define _CNSTATJ_CNSTATJ7_MASK                   0x00000080
#define _CNSTATJ_CNSTATJ7_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ8_POSITION               0x00000008
#define _CNSTATJ_CNSTATJ8_MASK                   0x00000100
#define _CNSTATJ_CNSTATJ8_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ9_POSITION               0x00000009
#define _CNSTATJ_CNSTATJ9_MASK                   0x00000200
#define _CNSTATJ_CNSTATJ9_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ10_POSITION              0x0000000A
#define _CNSTATJ_CNSTATJ10_MASK                  0x00000400
#define _CNSTATJ_CNSTATJ10_LENGTH                0x00000001

#define _CNSTATJ_CNSTATJ11_POSITION              0x0000000B
#define _CNSTATJ_CNSTATJ11_MASK                  0x00000800
#define _CNSTATJ_CNSTATJ11_LENGTH                0x00000001

#define _CNSTATJ_CNSTATJ12_POSITION              0x0000000C
#define _CNSTATJ_CNSTATJ12_MASK                  0x00001000
#define _CNSTATJ_CNSTATJ12_LENGTH                0x00000001

#define _CNSTATJ_CNSTATJ13_POSITION              0x0000000D
#define _CNSTATJ_CNSTATJ13_MASK                  0x00002000
#define _CNSTATJ_CNSTATJ13_LENGTH                0x00000001

#define _CNSTATJ_CNSTATJ14_POSITION              0x0000000E
#define _CNSTATJ_CNSTATJ14_MASK                  0x00004000
#define _CNSTATJ_CNSTATJ14_LENGTH                0x00000001

#define _CNSTATJ_CNSTATJ15_POSITION              0x0000000F
#define _CNSTATJ_CNSTATJ15_MASK                  0x00008000
#define _CNSTATJ_CNSTATJ15_LENGTH                0x00000001

#define _CNSTATJ_w_POSITION                      0x00000000
#define _CNSTATJ_w_MASK                          0xFFFFFFFF
#define _CNSTATJ_w_LENGTH                        0x00000020

#define _ANSELK_w_POSITION                       0x00000000
#define _ANSELK_w_MASK                           0xFFFFFFFF
#define _ANSELK_w_LENGTH                         0x00000020

#define _TRISK_TRISK0_POSITION                   0x00000000
#define _TRISK_TRISK0_MASK                       0x00000001
#define _TRISK_TRISK0_LENGTH                     0x00000001

#define _TRISK_TRISK1_POSITION                   0x00000001
#define _TRISK_TRISK1_MASK                       0x00000002
#define _TRISK_TRISK1_LENGTH                     0x00000001

#define _TRISK_TRISK2_POSITION                   0x00000002
#define _TRISK_TRISK2_MASK                       0x00000004
#define _TRISK_TRISK2_LENGTH                     0x00000001

#define _TRISK_TRISK3_POSITION                   0x00000003
#define _TRISK_TRISK3_MASK                       0x00000008
#define _TRISK_TRISK3_LENGTH                     0x00000001

#define _TRISK_TRISK4_POSITION                   0x00000004
#define _TRISK_TRISK4_MASK                       0x00000010
#define _TRISK_TRISK4_LENGTH                     0x00000001

#define _TRISK_TRISK5_POSITION                   0x00000005
#define _TRISK_TRISK5_MASK                       0x00000020
#define _TRISK_TRISK5_LENGTH                     0x00000001

#define _TRISK_TRISK6_POSITION                   0x00000006
#define _TRISK_TRISK6_MASK                       0x00000040
#define _TRISK_TRISK6_LENGTH                     0x00000001

#define _TRISK_TRISK7_POSITION                   0x00000007
#define _TRISK_TRISK7_MASK                       0x00000080
#define _TRISK_TRISK7_LENGTH                     0x00000001

#define _TRISK_w_POSITION                        0x00000000
#define _TRISK_w_MASK                            0xFFFFFFFF
#define _TRISK_w_LENGTH                          0x00000020

#define _PORTK_RK0_POSITION                      0x00000000
#define _PORTK_RK0_MASK                          0x00000001
#define _PORTK_RK0_LENGTH                        0x00000001

#define _PORTK_RK1_POSITION                      0x00000001
#define _PORTK_RK1_MASK                          0x00000002
#define _PORTK_RK1_LENGTH                        0x00000001

#define _PORTK_RK2_POSITION                      0x00000002
#define _PORTK_RK2_MASK                          0x00000004
#define _PORTK_RK2_LENGTH                        0x00000001

#define _PORTK_RK3_POSITION                      0x00000003
#define _PORTK_RK3_MASK                          0x00000008
#define _PORTK_RK3_LENGTH                        0x00000001

#define _PORTK_RK4_POSITION                      0x00000004
#define _PORTK_RK4_MASK                          0x00000010
#define _PORTK_RK4_LENGTH                        0x00000001

