MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG144/mcu.h
#define _SQI1STAT2_SQID1_POSITION                0x00000004
#define _SQI1STAT2_SQID1_MASK                    0x00000010
#define _SQI1STAT2_SQID1_LENGTH                  0x00000001

#define _SQI1STAT2_SQID2_POSITION                0x00000005
#define _SQI1STAT2_SQID2_MASK                    0x00000020
#define _SQI1STAT2_SQID2_LENGTH                  0x00000001

#define _SQI1STAT2_SQID3_POSITION                0x00000006
#define _SQI1STAT2_SQID3_MASK                    0x00000040
#define _SQI1STAT2_SQID3_LENGTH                  0x00000001

#define _SQI1BDCON_DMAEN_POSITION                0x00000000
#define _SQI1BDCON_DMAEN_MASK                    0x00000001
#define _SQI1BDCON_DMAEN_LENGTH                  0x00000001

#define _SQI1BDCON_POLLEN_POSITION               0x00000001
#define _SQI1BDCON_POLLEN_MASK                   0x00000002
#define _SQI1BDCON_POLLEN_LENGTH                 0x00000001

#define _SQI1BDCON_START_POSITION                0x00000002
#define _SQI1BDCON_START_MASK                    0x00000004
#define _SQI1BDCON_START_LENGTH                  0x00000001

#define _SQI1BDCURADD_BDCURRADDR_POSITION        0x00000000
#define _SQI1BDCURADD_BDCURRADDR_MASK            0xFFFFFFFF
#define _SQI1BDCURADD_BDCURRADDR_LENGTH          0x00000020

#define _SQI1BDBASEADDR_BDADDR_POSITION          0x00000000
#define _SQI1BDBASEADDR_BDADDR_MASK              0xFFFFFFFF
#define _SQI1BDBASEADDR_BDADDR_LENGTH            0x00000020

#define _SQI1BDSTAT_BDCON_POSITION               0x00000000
#define _SQI1BDSTAT_BDCON_MASK                   0x0000FFFF
#define _SQI1BDSTAT_BDCON_LENGTH                 0x00000010

#define _SQI1BDSTAT_DMAACTV_POSITION             0x00000010
#define _SQI1BDSTAT_DMAACTV_MASK                 0x00010000
#define _SQI1BDSTAT_DMAACTV_LENGTH               0x00000001

#define _SQI1BDSTAT_DMASTART_POSITION            0x00000011
#define _SQI1BDSTAT_DMASTART_MASK                0x00020000
#define _SQI1BDSTAT_DMASTART_LENGTH              0x00000001

#define _SQI1BDSTAT_BDSTATE_POSITION             0x00000012
#define _SQI1BDSTAT_BDSTATE_MASK                 0x003C0000
#define _SQI1BDSTAT_BDSTATE_LENGTH               0x00000004

#define _SQI1BDPOLLCON_POLLCON_POSITION          0x00000000
#define _SQI1BDPOLLCON_POLLCON_MASK              0x0000FFFF
#define _SQI1BDPOLLCON_POLLCON_LENGTH            0x00000010

#define _SQI1BDTXDSTAT_TXCURBUFLEN_POSITION      0x00000000
#define _SQI1BDTXDSTAT_TXCURBUFLEN_MASK          0x000000FF
#define _SQI1BDTXDSTAT_TXCURBUFLEN_LENGTH        0x00000008

#define _SQI1BDTXDSTAT_TXBUFCNT_POSITION         0x00000010
#define _SQI1BDTXDSTAT_TXBUFCNT_MASK             0x001F0000
#define _SQI1BDTXDSTAT_TXBUFCNT_LENGTH           0x00000005

#define _SQI1BDTXDSTAT_TXSTATE_POSITION          0x00000019
#define _SQI1BDTXDSTAT_TXSTATE_MASK              0x1E000000
#define _SQI1BDTXDSTAT_TXSTATE_LENGTH            0x00000004

#define _SQI1BDRXDSTAT_RXCURBUFLEN_POSITION      0x00000000
#define _SQI1BDRXDSTAT_RXCURBUFLEN_MASK          0x000000FF
#define _SQI1BDRXDSTAT_RXCURBUFLEN_LENGTH        0x00000008

#define _SQI1BDRXDSTAT_RXBUFCNT_POSITION         0x00000010
#define _SQI1BDRXDSTAT_RXBUFCNT_MASK             0x001F0000
#define _SQI1BDRXDSTAT_RXBUFCNT_LENGTH           0x00000005

#define _SQI1BDRXDSTAT_RXSTATE_POSITION          0x00000019
#define _SQI1BDRXDSTAT_RXSTATE_MASK              0x1E000000
#define _SQI1BDRXDSTAT_RXSTATE_LENGTH            0x00000004

#define _SQI1THR_THRES_POSITION                  0x00000000
#define _SQI1THR_THRES_MASK                      0x0000007F
#define _SQI1THR_THRES_LENGTH                    0x00000007

#define _SQI1INTSEN_TXEMPTYISE_POSITION          0x00000000
#define _SQI1INTSEN_TXEMPTYISE_MASK              0x00000001
#define _SQI1INTSEN_TXEMPTYISE_LENGTH            0x00000001

#define _SQI1INTSEN_TXFULLISE_POSITION           0x00000001
#define _SQI1INTSEN_TXFULLISE_MASK               0x00000002
#define _SQI1INTSEN_TXFULLISE_LENGTH             0x00000001

#define _SQI1INTSEN_TXTHRISE_POSITION            0x00000002
#define _SQI1INTSEN_TXTHRISE_MASK                0x00000004
#define _SQI1INTSEN_TXTHRISE_LENGTH              0x00000001

#define _SQI1INTSEN_RXEMPTYISE_POSITION          0x00000003
#define _SQI1INTSEN_RXEMPTYISE_MASK              0x00000008
#define _SQI1INTSEN_RXEMPTYISE_LENGTH            0x00000001

#define _SQI1INTSEN_RXFULLISE_POSITION           0x00000004
#define _SQI1INTSEN_RXFULLISE_MASK               0x00000010
#define _SQI1INTSEN_RXFULLISE_LENGTH             0x00000001

#define _SQI1INTSEN_RXTHRISE_POSITION            0x00000005
#define _SQI1INTSEN_RXTHRISE_MASK                0x00000020
#define _SQI1INTSEN_RXTHRISE_LENGTH              0x00000001

#define _SQI1INTSEN_CONFULLISE_POSITION          0x00000006
#define _SQI1INTSEN_CONFULLISE_MASK              0x00000040
#define _SQI1INTSEN_CONFULLISE_LENGTH            0x00000001

#define _SQI1INTSEN_CONEMPTYISE_POSITION         0x00000007
#define _SQI1INTSEN_CONEMPTYISE_MASK             0x00000080
#define _SQI1INTSEN_CONEMPTYISE_LENGTH           0x00000001

#define _SQI1INTSEN_CONTHRISE_POSITION           0x00000008
#define _SQI1INTSEN_CONTHRISE_MASK               0x00000100
#define _SQI1INTSEN_CONTHRISE_LENGTH             0x00000001

#define _SQI1INTSEN_BDDONEISE_POSITION           0x00000009
#define _SQI1INTSEN_BDDONEISE_MASK               0x00000200
#define _SQI1INTSEN_BDDONEISE_LENGTH             0x00000001

#define _SQI1INTSEN_PKTCOMPISE_POSITION          0x0000000A
#define _SQI1INTSEN_PKTCOMPISE_MASK              0x00000400
#define _SQI1INTSEN_PKTCOMPISE_LENGTH            0x00000001

#define _USBCSR0_FUNC_POSITION                   0x00000000
#define _USBCSR0_FUNC_MASK                       0x0000007F
#define _USBCSR0_FUNC_LENGTH                     0x00000007

#define _USBCSR0_SUSPEN_POSITION                 0x00000008
#define _USBCSR0_SUSPEN_MASK                     0x00000100
#define _USBCSR0_SUSPEN_LENGTH                   0x00000001

#define _USBCSR0_SUSPMODE_POSITION               0x00000009
#define _USBCSR0_SUSPMODE_MASK                   0x00000200
#define _USBCSR0_SUSPMODE_LENGTH                 0x00000001

#define _USBCSR0_RESUME_POSITION                 0x0000000A
#define _USBCSR0_RESUME_MASK                     0x00000400
#define _USBCSR0_RESUME_LENGTH                   0x00000001

